In [1]:
import numpy as np
from numpy import NaN as NA
import pandas as pd
from numpy.random import randn
from numpy.linalg import inv,qr, eig ,det ,svd

import matplotlib.pyplot as plt
import random

from pandas import DataFrame , Series

## 数据库风格的DataFrame合并

In [2]:
df1 = DataFrame(
            {'key':list('bbacaab'),
            'data1':range(7)}
)

In [3]:
df2 = DataFrame(
            {'key':list('abd'),
            'data2':range(3)}
)

In [4]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [5]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [6]:
pd.merge(df1, df2, on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [7]:
df3 = df2.append(df2).reset_index()
del df3['index']

In [8]:
df3

   data2 key
0      0   a
1      1   b
2      2   d
3      0   a
4      1   b
5      2   d

In [9]:
pd.merge(df1, df3, how='inner')

    data1 key  data2
0       0   b      1
1       0   b      1
2       1   b      1
3       1   b      1
4       6   b      1
5       6   b      1
6       2   a      0
7       2   a      0
8       4   a      0
9       4   a      0
10      5   a      0
11      5   a      0

* 产生重复的值

## 索引上的合并

In [10]:
left1 = DataFrame(
           {
               'key':list('abaabc'),
               'value':range(6)
               
           }
)

In [11]:
right1 = DataFrame(
            {
                'group_val':[3.5,7]
                
            },
            index=['a', 'b']
)

In [12]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [13]:
right1

   group_val
a        3.5
b        7.0

In [14]:
pd.merge(left1,right1,left_on='key',right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

### 层次化索引合并

In [15]:
lefth = DataFrame(
            {
                'key1':'Ohio,Ohio,Ohio,Nevada,Nevada'.split(','),
                'key2':[2000, 2001, 2002, 2001, 2002],
                'data':np.arange(5.)
                
                
            }

)

In [16]:
righth = DataFrame(np.arange(12).reshape((6,2)),
                  index=[ 'Nevada,Nevada,Ohio,Ohio,Ohio,Ohio'.split(',') ,
                         [2001, 2000, 2000, 2000, 2001, 2002]],
                    columns =['event1','event2'])

In [17]:
lefth

   data    key1  key2
0   0.0    Ohio  2000
1   1.0    Ohio  2001
2   2.0    Ohio  2002
3   3.0  Nevada  2001
4   4.0  Nevada  2002

In [18]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [19]:
pd.merge(lefth, righth, left_on = 'key1,key2'.split(',') , right_index=True)

   data    key1  key2  event1  event2
0   0.0    Ohio  2000       4       5
0   0.0    Ohio  2000       6       7
1   1.0    Ohio  2001       8       9
2   2.0    Ohio  2002      10      11
3   3.0  Nevada  2001       0       1

## 轴向连接

In [20]:
arr = np.arange(12).reshape((3,4))

In [21]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [22]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [23]:
arr[0]

array([0, 1, 2, 3])

In [24]:
s1 = Series([0,1], index=list('ab'))

In [25]:
s2 = Series([2,3,4], index=list('cde'))

In [26]:
s3 = Series([5,6], index=list('fg'))

In [27]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [28]:
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [29]:
s4 = pd.concat([s1*5, s3])

In [30]:
s4

a    0
b    5
f    5
g    6
dtype: int64

In [31]:
pd.concat([s1, s4],  axis=1)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [32]:
s1

a    0
b    1
dtype: int64

In [33]:
pd.concat([s1, s4],  axis=1 , join='inner')

   0  1
a  0  0
b  1  5

In [34]:
pd.concat([s1, s4],  axis=1 ,join_axes=[[1,2,3,4]])

    0   1
1 NaN NaN
2 NaN NaN
3 NaN NaN
4 NaN NaN

In [35]:
pd.concat([s1, s4],  axis=1 ,join_axes=[1,2,3,4])

AssertionError: length of join_axes must not be equal to 1

In [ ]:
pd.concat([s1, s4],  axis=1 ,join_axes=[[1,2,3,4]])

In [43]:
result = pd.concat([s1, s2, s3],)

In [44]:
result

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [45]:
result = pd.concat([s1, s2, s3], keys=['one', 'two', 'three'])

In [46]:
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [47]:
result.unstack()

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [48]:
result = pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

In [49]:
result

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [52]:
df1 = DataFrame(np.arange(6).reshape(3,2), index=['a', 'b', 'c'], columns=['one', 'two'] )

In [53]:
df2 = DataFrame(5 + np.arange(4).reshape(2,2), index=['a',  'c'], columns=['three', 'four'] )

In [54]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [55]:
df2

   three  four
a      5     6
c      7     8

In [56]:
df1 + 1

   one  two
a    1    2
b    3    4
c    5    6

In [57]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

* 小测试

In [60]:
pd.concat({'level1':df1, 'level2':df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [64]:
pd.concat({'level1':df1, 'level2':df1}, axis=1)

  level1     level2
     one two    one two
a      0   1      0   1
b      2   3      2   3
c      4   5      4   5

## 合并重叠数据

In [68]:
a = Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
           index=list('fedcba')
          )

In [69]:
b = Series(np.arange(len(a),dtype=np.float64 ) ,
           index=list('fedcba')
          )

In [70]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [71]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [72]:
b[-1] = np.nan

In [73]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [74]:
np.where(pd.isnull(a), b, a)

array([ 0. ,  2.5,  2. ,  3.5,  4.5,  nan])

In [75]:
b[:-2]

f    0.0
e    1.0
d    2.0
c    3.0
dtype: float64

In [82]:
[1,2,3][-2:-1]

[2]

In [67]:
np.float64(11)

11.0